{"data":{"site":{"siteMetadata":{"title":"Paul Waweru","subtitle":"Software Engineer. Passion for travel and food. North London is Red. Navigating through this thing called life.","copyright":"© All rights reserved.","author":{"name":"Paul Waweru"},"disqusShortname":"","url":"https://lumen.netlify.com"}},"markdownRemark":{"id":"d709913e-a1b2-557b-b2ef-8cf12de3624e","html":"<p>Oh, and welcome to my new and revamped blog! For months I’ve been wanting to up my game and improve the look (and content of course) of my blog, and I’ve finally got around doing so. Anyway, back to the story…</p>\n<p>First of all, let’s begin with some context. Me and my co-founder and very good friend Charlie Dowler (<a href=\"https://www.instagram.com/charliedowler/\">@charliedowler</a> - that’s his instagram!) are aiming to shake the fitness industry through an imersive and easy-to-use app called Doit. Here is our elevator pitch:</p>\n<blockquote>\n<p>You’re into runnning, lifting weights at the gym or yoga. What if there was a way where you can meet someone with the same fitness interests, levels and schedule in your area, and exercise with them?</p>\n</blockquote>\n<p>So, how’s our pitch?! That is essentially what we are trying to acehive, a simple way for people to meet other lilke-minded individuals who want to work out and keep fit, all whilst creating relationships. We’ve been building the startup since August of this year, and it’s been an interesting and challening few months. Along with this and upcoming posts, I envision documenting our journey and experience as we navigate through building what we believe is a valualbe and life-chaging product, mistakes we made along the way and the success we achieve.</p>\n<p><strong>Where are you now?</strong></p>\n<p>Glad you asked! We’ve just applied to a startup school called We Are Nova, but it’s very early stage. So far, we’ve been documenting a breif business plan outlining what we are building and defining our target audience. In terms of the app, we have a proof on conept that’s a work in progress. We opted for a cross-platform approach using React Native, and all of our backend technology is hosted on AWS. </p>\n<p><strong>Where will you be in 6 months time?</strong></p>\n<p>Great question. Depending on how we progress with the startup school, we aim to have a working MVP by </p>","fields":{"tagSlugs":["/tags/startuplife/"]},"frontmatter":{"title":"Startup Life","tags":["startuplife"],"date":"2018-12-27T23:46:37.121Z","description":"I'm building a startup. Yes, you read correctly. That thing where literally everyone says is far too high risk and you should stick to your stable corporate job? Yes, that's what I'm doing. Wish me luck! Read more if you're interested in my journey..."}}},"pageContext":{"slug":"/posts/startup-life/"}}